//********************************************************* 
/*  文件名: TEST_62F08x_IO_INTERRUPT.c
*	功能：  FT62F08x_IO_INTERRUPT 功能演示
*   IC:    FT62F088 LQFP32
*   内部：   16M
*   内部：  16M/2T                                
*   说明：  程序中DemoPortOut(PB3)输出100帧50HZ的占空比为50%的方波后,MCU进入睡眠（睡眠电流2uA以下）
*        等待中断唤醒，当PC3电平变化中断触发后，重复以上流程;
*        注意事项：睡眠前使 PEIE = 1，GIE = 1
*
*   参考原理图 TEST_62F08x_sch.pdf
*/
//*********************************************************
#include "SYSCFG.h"
//**********************************************************
//***********************宏定义*****************************
#define		unchar				unsigned char 
#define		unint					unsigned int
#define		unlong				unsigned long

#define		DemoPortOut	PB3   
#define		DemoPortIn		RC3
 
unchar	FCount;
/*-------------------------------------------------
 *  函数名：interrupt ISR
 *	功能：  中断处理函数
 *  输入：  无
 *  输出：  无
 --------------------------------------------------*/
void interrupt ISR(void)				//PIC_HI-TECH使用
{ 
	if(EPIF0 & 0x08)
	{
		EPIF0 |= 0x08;					//写1清中断3响应标志位 
		PEIE = 0;
	}
}  
/*-------------------------------------------------
 *  函数名：POWER_INITIAL
 *	功能：  上电系统初始化
 *  输入：  无
 *  输出：  无
 --------------------------------------------------*/	
void POWER_INITIAL (void) 
{
	 
	OSCCON = 0B01110001;		//WDT 32KHZ IRCF=111=16MHz
												//Bit0=1,系统时钟为内部振荡器
												//Bit0=0,时钟源由FOSC<2：0>决定即编译选项时选择
	INTCON = 0;						//暂禁止所有中断
    
	PORTA = 0B00000000;		
	TRISA = 0B00000000;		//PA输入输出 0-输出 1-输入
	WPUA = 0B00000000;     	//PA端口上拉控制 1-开上拉 0-关上拉
    WPDA = 0B00000000;     	//PA端口上拉控制 1-开下拉 0-关下拉

	PORTB = 0B00000000;		
	TRISB = 0B00000000;		//PB输入输出 0-输出 1-输入
	WPUB = 0B00000000;     	//PB端口上拉控制 1-开上拉 0-关上拉
	WPDB = 0B00000000;     	//PB端口上拉控制 1-开下拉 0-关下拉

	PORTC = 0B00000000; 	
	TRISC = 0B00001000;		//PC输入输出 0-输出 1-输入
	WPUC = 0B00001000;     	//PC端口上拉控制 1-开上拉 0-关上拉
	WPDC = 0B00000000;     	//PC端口上拉控制 1-开下拉 0-关下拉

    PORTD = 0B00000000;		
	TRISD = 0B00000000;		//PD输入输出 0-输出 1-输入
	WPUD = 0B00000000;     	//PD端口上拉控制 1-开上拉 0-关上拉
    
	WPDD = 0B00000000;     	//PD端口上拉控制 1-开下拉 0-关下拉
    
    PSRC0  = 0B11111111;  	//PORTA,PORTB源电流设置最大
    //BIT7~BIT6:PORTB[7:4]源电流能力控制,BIT5~BIT4:PORTB[3:0]源电流能力控制 
    //BIT3~BIT2:PORTA[7:4]源电流能力控制,BIT1~BIT0:PORTA[3:0]源电流能力控制
    
    PSRC1  = 0B11111111;    //PORTC,PORTD源电流设置最大    
    //BIT7~BIT6:PORTD[7:4]源电流能力控制,BIT5~BIT4:PORTD[3:0]源电流能力控制 
    //BIT3~BIT2:PORTC[7:4]源电流能力控制,BIT1~BIT0:PORTC[3:0]源电流能力控制
    
    PSINK0 = 0B11111111;  	//PORTA灌电流设置最大 0:最小，1:最大
    PSINK1 = 0B11111111; 	//PORTB灌电流设置最大 0:最小，1:最大
    PSINK2 = 0B11111111;	//PORTC灌电流设置最大 0:最小，1:最大
    PSINK3 = 0B11111111;	//PORTD灌电流设置最大 0:最小，1:最大
	
    ANSELA = 0B00000000;    //全为数字管脚
 
}
/*-------------------------------------------------
 *	函数名称：DelayUs
 *	功能：   短延时函数 --16M-2T--大概快1%左右.
 *	输入参数：Time 延时时间长度 延时时长Time Us
 *	返回参数：无 
 -------------------------------------------------*/
void DelayUs(unsigned char Time)
{
	unsigned char a;
	for(a=0;a<Time;a++)
	{
		NOP();
	}
}                  
/*-------------------------------------------------
 *	函数名称：DelayMs
 *	功能：   短延时函数
 *	输入参数：Time 延时时间长度 延时时长Time ms
 *	返回参数：无 
 -------------------------------------------------*/
void DelayMs(unsigned char Time)
{
	unsigned char a,b;
	for(a=0;a<Time;a++)
	{
		for(b=0;b<5;b++)
		{
		 	DelayUs(197); 	//快1%
		}
	}
}
/*-------------------------------------------------
 *	函数名称：DelayS
 *	功能：   短延时函数
 *	输入参数：Time 延时时间长度 延时时长Time S
 *	返回参数：无 
 -------------------------------------------------*/
void DelayS(unsigned char Time)
{
	unsigned char a,b;
	for(a=0;a<Time;a++)
	{
		for(b=0;b<10;b++)
		{
		 	DelayMs(100); 
		}
	}
}

/*-------------------------------------------------
 *  函数名: IO_INT_INITIAL
 *	功能：  主函数
 *  输入：  无
 *  输出：  无
 --------------------------------------------------*/
void IO_INT_INITIAL(void)
{
	EPS0 = 0B10000000; 	//选择PC3管脚中断
    //Px0~Px3中断管脚选择
    EPS1 = 0B00000000;
    //Px4~Px7中断管脚选择
    
    ITYPE0 = 0B11000000;//双沿中断
    ITYPE1 = 0B00000000;
    
    EPIE0 = 0B00001000;//使能中断3
 	EPIF0 = 0xFF;					//写1清中断响应标志位 
   
	PEIE = 1;							//使能外部中断
	GIE = 1;							//开总中断
}
/*-------------------------------------------------
 *  函数名: main 
 *	功能：  主函数
 *  输入：  无
 *  输出：  无
 --------------------------------------------------*/
void main(void)
{
	POWER_INITIAL();				//系统初始化
    
	while(1)
	{
		for(FCount=0;FCount<100;FCount++)	//输出100次波形	
		{
			DemoPortOut = 1;				
			DelayMs(10);				//10ms 
			DemoPortOut = 0;
			DelayMs(10); 
		}
		IO_INT_INITIAL();				//初始化外部中断
        NOP();
        NOP();
        NOP();
		SLEEP();							//睡眠
        NOP();
        NOP();
        NOP();
    }
}